<?php

return [
	'email' => 'ইমেইল ঠিকানাটি বৈধ নয়।',
	'string' => 'অকার্যকর তথ্য পাঠানো হয়েছে',


	/*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

	'custom' => [
		'username' => [
			'required' => 'অনুগ্রহ করে আপনার ইমেইল ঠিকানা অথবা মোবাইল নম্বর প্রদান করুন।',
			'not_found' => 'এই ইমেইল ঠিকানা অথবা মোবাইল নম্বরে কোন ব্যবহারকারী খুঁজে পাওয়া যায়নি।'
		],
		'password' => [
			'required' => 'অনুগ্রহ করে পাসওয়ার্ড প্রদান করুন।',
			'password.min' => 'পাসওয়ার্ডে কমপক্ষে ' . enToBnNumConvert(':min') . 'টি অক্ষর থাকতে হবে',
		],
		'passwordConfirm' => [
			'required' => 'অনুগ্রহ করে পাসওয়ার্ড নিশ্চিত করুন।',
			'same' => 'পাসওয়ার্ড দুইটি মেলেনি।'
		],
		'name' => [
			'required' => 'অনুগ্রহ করে একটি নাম প্রদান করুন।',
			'max' => 'নামে ' . enToBnNumConvert(':max') . ' টির বেশি অক্ষর থাকা যাবে না।'
		],
		'mobile' => [
			'required' => 'অনুগ্রহ করে একটি মোবাইল নম্বর প্রদান করুন।',
			'max' => 'মোবাইল নম্বরটি বৈধ নয়।',
			'regex' => 'মোবাইল নম্বরটি বৈধ নয়।',
			'unique' => 'মোবাইল নম্বরটি অন্য একজন ব্যবহারকারী ব্যবহার করছেন।'
		],
		'email' => [
			'required' => 'অনুগ্রহ করে একটি ইমেইল ঠিকানা প্রদান করুন।',
			'email' => 'ইমেইল ঠিকানাটি বৈধ নয়।',
			'unique' => 'ইমেইল ঠিকানাটি অন্য একজন ব্যবহারকারী ব্যবহার করছেন।',
		],
		'current_password' => [
			'required' => 'অনুগ্রহ করে আপনার বর্তমান পাসওয়ার্ড প্রদান করুন।',
			'wrong' => 'বর্তমান পাসওয়ার্ডটি ভুল।'
		],
		'new_password' => [
			'required' => 'অনুগ্রহ করে আপনার নতুন পাসওয়ার্ড প্রদান করুন।',
			'min' => 'নতুন পাসওয়ার্ডে কমপক্ষে' . enToBnNumConvert(':min') . ' টি অক্ষর থাকতে হবে।'
		],
		'confirm_new_password' => [
			'required' => 'অনুগ্রহ করে আপনার নতুন পাসওয়ার্ডটি নিশ্চিত করুন।',
			'same' => 'নতুন পাসওয়ার্ড দুইটি মেলেনি।'
		],
		'balance' => [
			'numeric' => 'অনুগ্রহ করে একটি সংখ্যা প্রদান করুন।',
			'null_balance_type' => 'অনুগ্রহ করে ব্যালেন্সের ধরণ নির্বাচন করুন।'
		],
		'type' => [
			'required' => 'অনুগ্রহ করে ধরণ নির্বাচন করুন।',
			'integer' => 'অবৈধ ধরণ।',
			'between' => 'অবৈধ ধরণ।'
		],
		'description' => [
			'required' => 'অনুগ্রহ করে একটি বিবরণ প্রদান করুন।',
		],
		'amount' => [
			'required' => 'অনুগ্রহ করে পরিমাণ প্রদান করুন।',
		],
		'date' => [
			'required' => 'অনুগ্রহ করে একটি তারিখ প্রদান করুন।',
			'date_format' => 'তারিখটি বৈধ নয়।'
		],
		'customer_id' => [
			'exists' => "কাস্টমার খুঁজে পাওয়া যায়নি।"
		],
		'product_id' => [
			'exists' => "পন্য খুঁজে পাওয়া যায়নি।"
		],
		'receipt_id' => [
			'exists' => "রসিদ খুঁজে পাওয়া যায়নি।"
		]
	],

	'email.customer.unique' => 'ইমেইল ঠিকানাটি অন্য একজন কাস্টমার-এর।',
	'mobile.customer.unique' => 'মোবাইল নম্বরটি অন্য একজন কাস্টমার-এর।'
];
